----------------------------------------------------------------------------------------------------
-- ПРАКТИЧЕСКОЕ ЗАНЯТИЕ 6 --------------------------------------------------------------------------
----------------------------------------------------------------------------------------------------
-- 1. Вывести список номеров отделов, в которых нет сотрудников с идентификатором должности ST_CLERK.
--    Используйте операторы над множествами.

-- 2. Вывести идентификаторы и названия стран, в которых не располагаются подразделения компании.

-- 3. Используя операторы над множествами, вывести список должностей отделов 10, 50 и 20 в таком же порядке отделов. 
--    Включите в результат столбцы job_id и department_id.

-- 4. Выведите номер сотрудника и идентификатор его должности, если его текущая должность совпадает с той, 
--    которую он уже занимал, работая в компании.

-- 5. Вывести в одном запросе:
--    - фамилии и отделы всех сотрудников из табилцы EMPLOYEES, независимо от того, относятся ли они к какому-либо отделу, 
--    - номера и наименования всех отделов из таблицы DEPARTMENTS, независимо от того, есть ли в них сотрудники или нет.





