----------------------------------------------------------------------------------------------------
-- ПРАКТИЧЕСКОЕ ЗАНЯТИЕ 7 --------------------------------------------------------------------------
----------------------------------------------------------------------------------------------------
-- 1. Вывести фамилии и даты найма служащих, работающих в одном отделе вместе с Zlotkey.

-- 2. Вывести номера, фамилии и оклады, оклад которых выше среднего.
--    Отсортируйте данные в порядке увеличения окладов.

-- 3. Вывести номера, фамилии всех служащих, работающих в одном отделе с любым служащим, 
--    фамилия которого содержит букву u.

-- 4. Вывести фамилии, номера отделов и должности служащих, идентификатор местоположения
--    которых равен 1700.

-- 5. Вывести фамилии и оклады всех служащих подчиненных King.

-- 6. Вывести номер отдела, фамилию и должность для служащих, работающих в администрации
--    (department_name = 'Executive')

-- 7*. Выведите номера, фамилии и оклады всех служащих при условии, что оклады превышат 
--     средний и служащие работают в одном отделе с любым служащим, у которого фамилия содержит букву u.





